import pandas as pd


districts_data = [
    {"name": "Центральный административный округ", "X": 37.617634, "Y": 55.755787},
    {"name": "Зеленоградский административный округ", "X": 37.181683, "Y": 55.988857},
    {"name": "Новомосковский административный округ", "X": 37.352547, "Y": 55.609756},
    {"name": "Троицкий административный округ", "X": 37.326454, "Y": 55.494152},
    {"name": "Восточный административный округ", "X": 37.791595, "Y": 55.781979},
    {"name": "Западный административный округ", "X": 37.438660, "Y": 55.673714},
    {"name": "Северный административный округ", "X": 37.530670, "Y": 55.832916},
    {"name": "Южный административный округ", "X": 37.648773, "Y": 55.644276},
    {"name": "Северо-Восточный административный округ", "X": 37.621307, "Y": 55.851421},
    {"name": "Северо-Западный административный округ", "X": 37.422180, "Y": 55.845253},
    {"name": "Юго-Восточный административный округ", "X": 37.769623, "Y": 55.693844},
    {"name": "Юго-Западный административный округ", "X": 37.547150, "Y": 55.605507},
]

df = pd.DataFrame(districts_data)

writer = pd.ExcelWriter('districts.xlsx', engine='openpyxl')
df.to_excel(writer, sheet_name='Sheet1')
writer.save()

